RyanMcB8/BB8_STM32/Firmware/Custom_Drivers/Inc/lsm6dso32_reg.h
typedef enum
{
  LSM6DSO32_ALL_INT_PULSED            = 0,
  LSM6DSO32_BASE_LATCHED_EMB_PULSED   = 1,
  LSM6DSO32_BASE_PULSED_EMB_LATCHED   = 2,
  LSM6DSO32_ALL_INT_LATCHED           = 3,
} lsm6dso32_lir_t;
int32_t lsm6dso32_int_notification_set(const stmdev_ctx_t *ctx,
                                       lsm6dso32_lir_t val);
int32_t lsm6dso32_int_notification_get(const stmdev_ctx_t *ctx,
                                       lsm6dso32_lir_t *val);

typedef enum
{
  LSM6DSO32_LSb_FS_DIV_64       = 0,
  LSM6DSO32_LSb_FS_DIV_256      = 1,
} lsm6dso32_wake_ths_w_t;
int32_t lsm6dso32_wkup_ths_weight_set(const stmdev_ctx_t *ctx,
                                      lsm6dso32_wake_ths_w_t val);
int32_t lsm6dso32_wkup_ths_weight_get(const stmdev_ctx_t *ctx,
                                      lsm6dso32_wake_ths_w_t *val);

int32_t lsm6dso32_wkup_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_wkup_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_xl_usr_offset_on_wkup_set(const stmdev_ctx_t *ctx,
                                            uint8_t val);
int32_t lsm6dso32_xl_usr_offset_on_wkup_get(const stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t lsm6dso32_wkup_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_wkup_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_gy_sleep_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_gy_sleep_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_DRIVE_SLEEP_CHG_EVENT = 0,
  LSM6DSO32_DRIVE_SLEEP_STATUS    = 1,
} lsm6dso32_sleep_status_on_int_t;
int32_t lsm6dso32_act_pin_notification_set(const stmdev_ctx_t *ctx,
                                           lsm6dso32_sleep_status_on_int_t val);
int32_t lsm6dso32_act_pin_notification_get(const stmdev_ctx_t *ctx,
                                           lsm6dso32_sleep_status_on_int_t *val);

typedef enum
{
  LSM6DSO32_XL_AND_GY_NOT_AFFECTED      = 0,
  LSM6DSO32_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  LSM6DSO32_XL_12Hz5_GY_SLEEP           = 2,
  LSM6DSO32_XL_12Hz5_GY_PD              = 3,
} lsm6dso32_inact_en_t;
int32_t lsm6dso32_act_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_inact_en_t val);
int32_t lsm6dso32_act_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_inact_en_t *val);

int32_t lsm6dso32_act_sleep_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_act_sleep_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_tap_detection_on_z_set(const stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t lsm6dso32_tap_detection_on_z_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso32_tap_detection_on_y_set(const stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t lsm6dso32_tap_detection_on_y_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso32_tap_detection_on_x_set(const stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t lsm6dso32_tap_detection_on_x_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso32_tap_threshold_x_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tap_threshold_x_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  LSM6DSO32_XYZ = 0,
  LSM6DSO32_YXZ = 1,
  LSM6DSO32_XZY = 2,
  LSM6DSO32_ZYX = 3,
  LSM6DSO32_YZX = 5,
  LSM6DSO32_ZXY = 6,
} lsm6dso32_tap_priority_t;
int32_t lsm6dso32_tap_axis_priority_set(const stmdev_ctx_t *ctx,
                                        lsm6dso32_tap_priority_t val);
int32_t lsm6dso32_tap_axis_priority_get(const stmdev_ctx_t *ctx,
                                        lsm6dso32_tap_priority_t *val);

int32_t lsm6dso32_tap_threshold_y_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tap_threshold_y_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dso32_tap_threshold_z_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tap_threshold_z_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dso32_tap_shock_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tap_shock_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_tap_quiet_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tap_quiet_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_ONLY_SINGLE = 0,
  LSM6DSO32_BOTH_SINGLE_DOUBLE = 1,
} lsm6dso32_single_double_tap_t;
int32_t lsm6dso32_tap_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dso32_single_double_tap_t val);
int32_t lsm6dso32_tap_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dso32_single_double_tap_t *val);

typedef enum
{
  LSM6DSO32_DEG_68  = 0,
  LSM6DSO32_DEG_47  = 1,
} lsm6dso32_sixd_ths_t;
int32_t lsm6dso32_6d_threshold_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sixd_ths_t val);
int32_t lsm6dso32_6d_threshold_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_sixd_ths_t *val);

int32_t lsm6dso32_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO32_FF_TSH_312mg = 0,
  LSM6DSO32_FF_TSH_438mg = 1,
  LSM6DSO32_FF_TSH_500mg = 2,
} lsm6dso32_ff_ths_t;
int32_t lsm6dso32_ff_threshold_set(const stmdev_ctx_t *ctx,
                                   lsm6dso32_ff_ths_t val);
int32_t lsm6dso32_ff_threshold_get(const stmdev_ctx_t *ctx,
                                   lsm6dso32_ff_ths_t *val);

int32_t lsm6dso32_ff_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso32_ff_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso32_fifo_watermark_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dso32_fifo_watermark_get(const stmdev_ctx_t *ctx,
                                     uint16_t *val);

int32_t lsm6dso32_compression_algo_init_set(const stmdev_ctx_t *ctx,
                                            uint8_t val);
int32_t lsm6dso32_compression_algo_init_get(const stmdev_ctx_t *ctx,
                                            uint8_t *val);

