RyanMcB8/BB8_STM32/Firmware/Custom_Drivers/Inc/lsm6dso32_reg.h
typedef enum
{
  LSM6DSO32_CMP_DISABLE  = 0x00,
  LSM6DSO32_CMP_ALWAYS   = 0x04,
  LSM6DSO32_CMP_8_TO_1   = 0x05,
  LSM6DSO32_CMP_16_TO_1  = 0x06,
  LSM6DSO32_CMP_32_TO_1  = 0x07,
} lsm6dso32_uncoptr_rate_t;
int32_t lsm6dso32_compression_algo_set(const stmdev_ctx_t *ctx,
                                       lsm6dso32_uncoptr_rate_t val);
int32_t lsm6dso32_compression_algo_get(const stmdev_ctx_t *ctx,
                                       lsm6dso32_uncoptr_rate_t *val);

int32_t lsm6dso32_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                                uint8_t val);
int32_t lsm6dso32_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                                uint8_t *val);

int32_t lsm6dso32_compression_algo_real_time_set(const stmdev_ctx_t *ctx,
                                                 uint8_t val);
int32_t lsm6dso32_compression_algo_real_time_get(const stmdev_ctx_t *ctx,
                                                 uint8_t *val);

int32_t lsm6dso32_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dso32_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  LSM6DSO32_XL_NOT_BATCHED       =  0,
  LSM6DSO32_XL_BATCHED_AT_12Hz5   =  1,
  LSM6DSO32_XL_BATCHED_AT_26Hz    =  2,
  LSM6DSO32_XL_BATCHED_AT_52Hz    =  3,
  LSM6DSO32_XL_BATCHED_AT_104Hz   =  4,
  LSM6DSO32_XL_BATCHED_AT_208Hz   =  5,
  LSM6DSO32_XL_BATCHED_AT_417Hz   =  6,
  LSM6DSO32_XL_BATCHED_AT_833Hz   =  7,
  LSM6DSO32_XL_BATCHED_AT_1667Hz  =  8,
  LSM6DSO32_XL_BATCHED_AT_3333Hz  =  9,
  LSM6DSO32_XL_BATCHED_AT_6667Hz  = 10,
  LSM6DSO32_XL_BATCHED_AT_6Hz5    = 11,
} lsm6dso32_bdr_xl_t;
int32_t lsm6dso32_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_bdr_xl_t val);
int32_t lsm6dso32_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_bdr_xl_t *val);

typedef enum
{
  LSM6DSO32_GY_NOT_BATCHED         = 0,
  LSM6DSO32_GY_BATCHED_AT_12Hz5    = 1,
  LSM6DSO32_GY_BATCHED_AT_26Hz     = 2,
  LSM6DSO32_GY_BATCHED_AT_52Hz     = 3,
  LSM6DSO32_GY_BATCHED_AT_104Hz    = 4,
  LSM6DSO32_GY_BATCHED_AT_208Hz    = 5,
  LSM6DSO32_GY_BATCHED_AT_417Hz    = 6,
  LSM6DSO32_GY_BATCHED_AT_833Hz    = 7,
  LSM6DSO32_GY_BATCHED_AT_1667Hz   = 8,
  LSM6DSO32_GY_BATCHED_AT_3333Hz   = 9,
  LSM6DSO32_GY_BATCHED_AT_6667Hz   = 10,
  LSM6DSO32_GY_BATCHED_AT_6Hz5     = 11,
} lsm6dso32_bdr_gy_t;
int32_t lsm6dso32_fifo_gy_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dso32_bdr_gy_t val);
int32_t lsm6dso32_fifo_gy_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dso32_bdr_gy_t *val);

typedef enum
{
  LSM6DSO32_BYPASS_MODE             = 0,
  LSM6DSO32_FIFO_MODE               = 1,
  LSM6DSO32_STREAM_TO_FIFO_MODE     = 3,
  LSM6DSO32_BYPASS_TO_STREAM_MODE   = 4,
  LSM6DSO32_STREAM_MODE             = 6,
  LSM6DSO32_BYPASS_TO_FIFO_MODE     = 7,
} lsm6dso32_fifo_mode_t;
int32_t lsm6dso32_fifo_mode_set(const stmdev_ctx_t *ctx,
                                lsm6dso32_fifo_mode_t val);
int32_t lsm6dso32_fifo_mode_get(const stmdev_ctx_t *ctx,
                                lsm6dso32_fifo_mode_t *val);

typedef enum
{
  LSM6DSO32_TEMP_NOT_BATCHED        = 0,
  LSM6DSO32_TEMP_BATCHED_AT_1Hz6    = 1,
  LSM6DSO32_TEMP_BATCHED_AT_12Hz5   = 2,
  LSM6DSO32_TEMP_BATCHED_AT_52Hz    = 3,
} lsm6dso32_odr_t_batch_t;
int32_t lsm6dso32_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                      lsm6dso32_odr_t_batch_t val);
int32_t lsm6dso32_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                      lsm6dso32_odr_t_batch_t *val);

typedef enum
{
  LSM6DSO32_NO_DECIMATION = 0,
  LSM6DSO32_DEC_1         = 1,
  LSM6DSO32_DEC_8         = 2,
  LSM6DSO32_DEC_32        = 3,
} lsm6dso32_odr_ts_batch_t;
int32_t lsm6dso32_fifo_timestamp_decimation_set(const stmdev_ctx_t *ctx,
                                                lsm6dso32_odr_ts_batch_t val);
int32_t lsm6dso32_fifo_timestamp_decimation_get(const stmdev_ctx_t *ctx,
                                                lsm6dso32_odr_ts_batch_t *val);

typedef enum
{
  LSM6DSO32_XL_BATCH_EVENT   = 0,
  LSM6DSO32_GYRO_BATCH_EVENT = 1,
} lsm6dso32_trig_counter_bdr_t;

typedef enum
{
  LSM6DSO32_GYRO_NC_TAG = 1,
  LSM6DSO32_XL_NC_TAG,
  LSM6DSO32_TEMPERATURE_TAG,
  LSM6DSO32_TIMESTAMP_TAG,
  LSM6DSO32_CFG_CHANGE_TAG,
  LSM6DSO32_XL_NC_T_2_TAG,
  LSM6DSO32_XL_NC_T_1_TAG,
  LSM6DSO32_XL_2XC_TAG,
  LSM6DSO32_XL_3XC_TAG,
  LSM6DSO32_GYRO_NC_T_2_TAG,
  LSM6DSO32_GYRO_NC_T_1_TAG,
  LSM6DSO32_GYRO_2XC_TAG,
  LSM6DSO32_GYRO_3XC_TAG,
  LSM6DSO32_SENSORHUB_SLAVE0_TAG,
  LSM6DSO32_SENSORHUB_SLAVE1_TAG,
  LSM6DSO32_SENSORHUB_SLAVE2_TAG,
  LSM6DSO32_SENSORHUB_SLAVE3_TAG,
  LSM6DSO32_STEP_COUNTER_TAG,
  LSM6DSO32_SENSORHUB_NACK_TAG = 0x19,
} lsm6dso32_fifo_tag_t;
int32_t lsm6dso32_fifo_cnt_event_batch_set(const stmdev_ctx_t *ctx,
                                           lsm6dso32_trig_counter_bdr_t val);
int32_t lsm6dso32_fifo_cnt_event_batch_get(const stmdev_ctx_t *ctx,
                                           lsm6dso32_trig_counter_bdr_t *val);

int32_t lsm6dso32_rst_batch_counter_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6dso32_rst_batch_counter_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6dso32_batch_counter_threshold_set(const stmdev_ctx_t *ctx,
                                              uint16_t val);
int32_t lsm6dso32_batch_counter_threshold_get(const stmdev_ctx_t *ctx,
                                              uint16_t *val);

int32_t lsm6dso32_fifo_data_level_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dso32_fifo_status_get(const stmdev_ctx_t *ctx,
                                  lsm6dso32_fifo_status2_t *val);

